---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments
source: html/c5b095c7-121f-6122-5a48-76c93022bc01.htm
---
# RebarShapeDefinitionBySegments Properties

Report whether the shape definition is fully
 constrained.